export default [
    {
        Name: 'Карта',
        Description: 'Карта дозволяє користувачам отримати візуальний огляд подій, та швидко орієнтуватися у подіях. Крім того, при натисканні на маркер можна переглянути детальну інформацію про обрану подію.',
        forAdmin: false,
    },
    {
        Name: 'Вкладка «Події»',
        Description: 'У вкладці «Події», можна переглянути повний список надзвичайних подій, а також вибрати подію та переглянути інформацію про неї. На вкладці «Події» також є зручний пошук, який надає можливість шукати конкретні події та фільтрувати дані залежно від назви, опису, рівня, типу та дати. А також сортувати дані у порядку зростання або спадання.',
        forAdmin: false,
    },
    {
        Name: 'Вкладка «Статистика»',
        Description: 'На цій вкладці ми зможемо познайомитися з детальною інформацією щодо надзвичайних ситуацій, включаючи їх кількість та величину завданих збитків. Також можна подивитися статистику за конкретний рік, вибравши необхідний рік з випадаючого списку.',
        forAdmin: false,
    },
    {
        Name: 'Вкладка «Позначення»',
        Description: 'На вкладці «Позначення» ви знайдете докладну інформацію про іконки, які використовуються на карті для відображення різних елементів. Ця вкладка надає вам зрозуміле пояснення кожної іконки. Також на цій вкладці можна знайти можливість змінити спосіб відображення іконок на карті, шляхом вибору між «Типом» та «Рівнем». Після внесення змін, ви побачите повідомлення, що підтверджує успішну зміну вибраного режиму відображення.',
        forAdmin: false,
    },
    {
        Name: 'Вкладка «Авторизація»',
        Description: 'Вкладка «Авторизація», надає можливість увійти до облікового запису адміністратора програмного продукту. При неправильному введенні даних ви побачите повідомлення про помилку. Якщо авторизація пройде успішно, ви побачите повідомлення про вдалий вхід в обліковий запис, і всі можливості адміністратора будуть доступні для використання.',
        forAdmin: false,
    },
    {
        Name: 'Додавання нової події',
        Description: 'Після успішної авторизації в розділі «Події» буде доступна спеціальна кнопка «Додати нову подію», яка дозволить створити нову подію. При додаванні нової надзвичайної події в систему ви матимете можливість вказати різноманітні дані. До основних даних, які можна вказати при додаванні нової події, належать: назва, опис, дата та час, рівень та тип. Крім цього, для поліпшення зрозумілості інформації про подію, можна додати зображення події. Додатковою корисною інформацією може бути зазначення місця, де відбулася надзвичайна подія, та визначення її масштабів і наслідків, включаючи збитки після надзвичайної ситуації.',
        forAdmin: true,
    },
    {
        Name: 'Редагування та Видалення',
        Description: 'На вкладці перегляду інформації про надзвичайну подію, при авторизації додаються дві кнопки, які дають можливість редагувати та видаляти вибрану подію. У разі успішного редагування події буде відображено відповідне повідомлення. При спробі видалення даних система запитає у нас про підтвердження дії.',
        forAdmin: true,
    },
    {
        Name: 'Створення звіту',
        Description: 'На вкладці «Статистика» після авторизації буде доступно створення звіту за рік або за конкретний місяць. Згенерований звіт зберігається в документі формату «.docx».',
        forAdmin: true,
    },
    {
        Name: 'Вкладка «Адмін панель»',
        Description: 'Після авторизації стає доступною вкладка «Адмін панель», яка дає можливість здійснювати різноманітні операції з таблицями бази даних, такі як додавання, редагування, пошук, сортування та видалення.',
        forAdmin: true,
    },
    {
        Name: 'Резервне копіювання бази даних',
        Description: 'На вкладці «Адмін панель» є зручна можливість створення резервної копії бази даних, щоб забезпечити безпеку та збереження важливих даних.',
        forAdmin: true,
    },
    {
        Name: 'Вихід з облікового запису',
        Description: 'Для виходу з облікового запису адміністратора можна перейти у відповідну вкладку «Вихід» і натиснути кнопку підтвердження.',
        forAdmin: true,
    },
]